<?php

// Завдання 1
//$a = 3;
//echo $a;
// Завдання 2
//$a = 10;
//$b = 2;
//echo "Додавання чисел: " .$a+$b . "<br>"."Віднімання  чисел: " .$a-$b . "<br>"."Множення  чисел: " .$a*$b . "<br>"."Ділення  чисел: " .$a/$b . "<br>";
// Завдання 3
//$c = 15;
//$d = 2;
//$result = $c+$d;
//echo $result;
// Завдання 4
//$a = 10;
//$b = 2;
//$c = 5;
//echo $a + $b + $c;
// Завдання 5
//$a = 17;
//$b = 10;
//$c = $a-$b;
//$d = 7;
//$result = $c + $d;
//echo $result;
// Завдання 6
//$text = 'Привіт, Світ!';
//echo $text;
// Завдання 7
//$text1 = 'Привіт, ';
//$text2 = 'Світ!';
//echo $text1 . $text2;
// Завдання 8
//$name = 'Владислав';
//echo 'Привіт, ' . $name . '!';
// Завдання 9
//$age = 22;
//echo 'Мені '. $age . ' роки!';
// Завдання 10
//$text = 'abcde';
//echo $text[0] . "<br>" .$text[2] . "<br>" .$text[4];
// Завдання 11
//$num = '12345';
//echo $num[0] + $num[1] + $num[2] + $num[3] + $num[4];
//echo array_sum(str_split($num));
// Завдання 12
//$hour = 60 * 60;
//$day = $hour * 24;
//$month = $day * 31;
//echo 'К-сть секунд у годині: '.$hour.' К-сть секунд у добі: '.$day.' К-сть секунд у місяці: '.$month;
// Завдання 13
//$hour = date('H') + 2;
//$minute = date('i');
//$seconds = date('s');
//echo $hour . ':'.$minute.':'.$seconds;
// Завдання 14
//$num = 10;
//echo pow($num,2);
// Завдання 14
//$var = 47;
//$var +=7;
//$var -=18;
//$var *=10;
//$var /=20;
//echo $var;
// Завдання 15
//$text = 'Я';
//$text .=' хочу';
//$text .=' знати';
//$text .=' PHP!';
//echo $text;
// Завдання 16
//$var = 10;
//$var++;
//$var++;
//$var--;
//echo $var;
// Завдання 17
//$var = 10;
//$var += 7;
//$var++;
//$var--;
//$var +=12;
//$var *=7;
//$var -=15;
//echo $var;
// Завдання 18,19
//$arr=['a', 'b', 'c'];
//var_dump($arr);
//foreach ($arr as $item) {
//    echo "<br>" .$item ;
//}
// Завдання 20
//$arr=['a', 'b', 'c', 'd'];
//echo "$arr[0]+$arr[1], $arr[2]+$arr[3]";
// Завдання 21
//$arr= [2,5,3,9];
//$result = ($arr[0]*$arr[1]) + ($arr[2] * $arr[3]);
//echo $result;
// Завдання 22
//$arr[] = 1;
//$arr[] = 2;
//$arr[] = 3;
//$arr[] = 4;
//$arr[] = 5;
//print_r($arr);
// Завдання 23
//$arr = ['a'=>1, 'b'=>2, 'c'=>3];
//echo $arr['c'];
// Завдання 24
//$arr = ['a'=>1, 'b'=>2, 'c'=>3];
//$sum = array_sum($arr);
//echo $sum;
// Завдання 25
//$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
//echo "Зарплата Петрика " . $arr['Петя'] . "<br>" . "Зарплата Колі " . $arr['Коля'];
// Завдання 26,27
//$arr = [
//    1=>"Понеділок",
//    2=>"Вівторок",
//    3=>"Середа",
//    4=>"Четвер",
//    5=>"П'ятниця",
//    6=>"Субота",
//    7=>"Неділя",
//];
//echo $arr[2];
//$day = array_search('Вівторок',$arr);
//echo "<br>". $arr[$day];
// Завдання 28
//$arr = [
//    'cms'=>['joomla', 'wordpress', 'drupal'],
//    'colors'=>['blue'=>'блакитний', 'red'=>'червоний', 'green'=>'зелений']
//];
//
//echo $arr['cms'][0] . "<br>" . $arr['cms'][2]. "<br>" . $arr['colors']['green']. "<br>" . $arr['colors']['red'];
// Завдання 29
//$arr = [
//    'ua'=>[
//        1=>"Понеділок",
//        2=>"Вівторок",
//        3=>"Середа",
//        4=>"Четвер",
//        5=>"П'ятниця",
//        6=>"Субота",
//        7=>"Неділя",
//    ],
//    'en'=>[
//        1=>"Monday",
//        2=>"Tuesday",
//        3=>"Wednesday",
//        4=>"Thursday",
//        5=>"Friday",
//        6=>"Saturday",
//        7=>"Sunday",
//    ],
//];
//echo $arr['ua'][1] ."<br>". $arr['en'][3];
//
//$lang = 'en';
//$day = 3;
//
//echo "<br>". $arr[$lang][$day];
